Show / Hide Table of Contents
Class CheckMember1D
Check meber 1D
Inheritance
System.Object
OpenObject
OpenElementId
CheckMember
CheckMember1D
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Model
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.Services.Common.CheckMember1D,CI.ServicesCommon", "CI.StructModel.Structure.ICheckMember, CI.BasicTypes", typeof(CheckMember))]
public class CheckMember1D : CheckMember
Constructors
Improve this Doc   View Source
CheckMember1D()
Constructor
Declaration
public CheckMember1D()
 Improve this Doc
 View Source